LC4WithExtensionFilling/0/blueprints/flowrate/k
    {
        type            inletOutlet;
        inletValue      uniform 0.01;
        value           uniform 0.01;
    }
    
