LC4WithExtensionFilling/0/blueprints/flowrate/p_rgh.1
    {
        type            fixedFluxPressure;      // Alternative: zeroGradient
    }
