LC4WithExtensionFilling/0/blueprints/wall_friction/nut.2
        Cs              uniform 0.5;    // roughness constant, default 0.5
        value           uniform 0.0;
    }
    
