LC4WithExtensionFilling/constant/fvOptions
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Code template and library provided by Thorenz, C. (2024), DOI: 10.3929/ethz-b-000675949

// Optional: Limit velocities to stabilize the model
// limitU
//    {
//        type            limitVelocity; // Adds an explicit momentum source to limit high velocities
//        active          yes;           
//        selectionMode   all;
//        max             25.0;          // Set this to a value higher than anything you would physically expect!
//    }



