LC4WithExtensionFilling/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Code template and library provided by Thorenz, C. (2024), DOI: 10.3929/ethz-b-000675949

defaultFieldValues
(
    volScalarFieldValue alpha.water 1//only water in the domain
);

regions
(
    boxToCell
    {
        box (0 0 0.42) (0.72 0.5 0.7);
        fieldValues
        (
            volScalarFieldValue alpha.water 0//we set our block of air into the domain
        );
    }
	
	    boxToCell
    {
        box (0.72 0 0.273) (2.5 0.5 0.7); //0.273
        fieldValues
        (
            volScalarFieldValue alpha.water 0//we set our block of air into the domain
        );
    }
);


// ************************************************************************* //
